# Pandas tutorial

* it is a powerful python data analysis toolkit
* A fast and efficient Dataframe object for data manipulation
* we can read and write : csv , txt , xml , json , zip etc

## Pandas Data structure

* **Series** : one dimentional homogeneous labelled data
* **DataFrame** : Two dimentional hetrogeneous tabular structure
* **panel** : three dimentional lebelled data

### Series

In [2]:
import pandas as pd
list1 = [1,2,3,4,5]
s1 = pd.Series(list1 , dtype = int)

In [3]:
print(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [4]:
S1 = pd.Series(list1 , ["a","b","c","d","e" ], dtype = int ,  name = "data points")
print(S1)
print(type(S1))

a    1
b    2
c    3
d    4
e    5
Name: data points, dtype: int32
<class 'pandas.core.series.Series'>

In [5]:
S1["c"]

3

In [6]:
s2 = pd.Series([1,2,3,4,5])

In [7]:
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

### DataFrame

### Handling missing values

In [8]:
neeraj = pd.read_csv("C://Users//Prem//Desktop//Water Quality//water_potability.csv")
neeraj.head()

,ph,Hardness,Solids,Chloramines,Sulfate,Conductivity,Organic_carbon,Trihalomethanes,Turbidity,Potability
0,NaN,204.890456,20791.31898,7.300212,368.516441,564.308654,10.379783,86.990970,2.963135,0
1,3.716080,129.422921,18630.05786,6.635246,NaN,592.885359,15.180013,56.329076,4.500656,0
2,8.099124,224.236259,19909.54173,9.275884,NaN,418.606213,16.868637,66.420093,3.055934,0
3,8.316766,214.373394,22018.41744,8.059332,356.886136,363.266516,18.436525,100.341674,4.628771,0
4,9.092223,181.101509,17978.98634,6.546600,310.135738,398.410813,11.558279,31.997993,4.075075,0

In [9]:
df1 = pd.read_csv("titanic.csv")
df1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [10]:
df1.shape

(891, 15)

In [12]:
df1.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [ ]:
df1.tail()

In [ ]:
df1.describe()

In [ ]:
df1.info()

In [ ]:
df1.isnull().sum() ## it will find missing values in columns

In [ ]:
df1 = df1.dropna() ## drop rows in which we have missing values

In [ ]:
df1.shape

In [ ]:
df1.isnull().sum()

In [ ]:
df1.columns

In [ ]:
df1.drop("survived" ,axis = 1 )

In [ ]:
df1.head()

### Fillna()

In [ ]:
df1 = pd.read_csv("titanic.csv" )

In [ ]:
df1.head(10)

In [ ]:
df1.fillna("neha" , inplace = True)

In [ ]:
df1.head()

In [ ]:
df1["deck"].fillna("abc" , inplace=True)

In [ ]:
df1.head(10)

In [ ]:
df1[["deck", "age"]] = df1[["deck", "age"]].fillna("ab")
df1.head(10)

In [ ]:
df1[["deck", "age" , "fare" , "sibsp"]]

In [ ]:
df1 = df1.fillna({"deck": "neha" , "age" : 28 })

In [ ]:
df1.head(10)

In [ ]:
df1.to_excel("prem.xlsx")

### Replace()

In [ ]:
df2 = pd.read_csv("titanic.csv" )
df2.head()

In [ ]:
df2.replace( "male" ,"female" , inplace = True)

In [ ]:
df2.head()

In [ ]:
df2["class"].replace("Third" , "Five"  , inplace = True)

In [ ]:
df2["alone"].replace({False : True , True : False} , inplace = True )

In [ ]:
df2.head()

In [ ]:
df2.replace("male", "female" , inplace = True)
df2.head()

In [ ]:
df2["age"] = df2["age"].replace(22.0 , 26.0)
df2.head(10)

In [ ]:
df2["pclass"].replace({1 : 0 , 3 : 0 , 2 : 0} , inplace = True)

In [ ]:
df2.head(10)

In [ ]:
df2 = df2.replace("[A-Za-z]" , 0 , regex= True)
df2.head()

###  iloc

In [ ]:
df3 = pd.read_csv("SalaryGender.csv")
df3

In [ ]:
df3.shape

In [ ]:
df3.iloc[0]

In [ ]:
df3.iloc[:,:]

In [ ]:
df3.iloc[:,:-1]

In [ ]:
df3.head(10)

In [ ]:
df3.iloc[2:5,1:3]

### Groupby()

In [ ]:
df3

In [ ]:
gr = df3.groupby(by = "Gender")

In [ ]:
gr.groups

In [ ]:
for a , b in gr:
    print(a)
    print(b)

In [ ]:
gr.mean()

In [ ]:
gr.sum()

### Concat()

In [ ]:
df6 =pd.DataFrame(({"ID" : [1,2,3,4],
       "Name" : ["a", "b","c", "d"],
       "Class" : [5,6,7,8],
        "marks" :[10 , 20 , 30 , 40]}))

In [ ]:
df6.head()

In [ ]:
df7 =pd.DataFrame({"ID" : [1,2,3,4 , 5],
       "Name" : ["e", "f","g", "h" , "e"],
       "Class" : [9,10,11,12 , 7],
        "marks" : [50 , 60 , 70 , 80 , 90]})

In [ ]:
df7.head()

In [ ]:
data = pd.concat([df6,df7] , axis = 0) ### column wise

In [ ]:
data

In [ ]:
pd.concat([df7,df6] , axis = 1)

### Pivot_table()

In [ ]:
df8 = pd.read_csv("SalaryGender.csv" )
df8.head()

In [ ]:
df8.pivot_table(index = "Gender" , aggfunc="mean")

In [ ]:
df8.pivot_table(index = "Gender" , columns = "PhD" , aggfunc = "mean" )